<?php

use Illuminate\Database\Seeder;
use Illuminate\Support\Facades\DB;

class FacultiesTableSeeder extends Seeder
{
    /**
     * Run the database seeds.
     *
     * @return void
     */
    public function run()
    {
        DB::table('faculties')->insert([
            ['name' => 'Факультет физики, математики и инженерных технологий'],
            ['name' => 'Факультет цифровых технологий и кибербезопасности'],
            ['name' => 'Факультет архитектуры и дизайна'],
            ['name' => 'Факультет агробизнеса, технологий и ветеринарной медицины'],
            ['name' => 'Геолого-географический факультет'],
            ['name' => 'Химический факультет'],
            ['name' => 'Биологический факультет'],
            ['name' => 'Факультет психологии'],
            ['name' => 'Факультет педагогики и социальной работы'],
            ['name' => 'Факультет физической культуры и спорта'],
            ['name' => 'Исторический факультет'],
            ['name' => 'Факультет социальных коммуникаций'],
            ['name' => 'Юридический факультет'],
            ['name' => 'Факультет иностранных языков'],
            ['name' => 'Факультет филологии и журналистики'],
            ['name' => 'Факультет экономики и управления'],
        ]);
    }
}
